Autodesk.Revit.DB.LinearArray.IsElementArrayable(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Indicates whether the input element is arrayable.
aDoc:
The document.
id:
The element id.
Returns:
True if the input element is arrayable, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.LinearArray.IsValidArraySize(System.Int32)
This indicates whether the input count is valid.
count:
The count.
Returns:
True if the input count is between 2 and 200, false otherwise.

Autodesk.Revit.DB.LinearArray.ArrayElementWithoutAssociation(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId,System.Int32,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ArrayAnchorMember)
Creates a new linear array from a single element.
Remarks:
The resulting elements will not be associated with an array element.
aDoc:
The document.
dBView:
The view. If it is a 2d view, translation vector must be in the view plane if the element is a view-specific element.
id:
The element to array.
count:
The number of array members to create including the initial
element grouping. Must between 2 and 200.
translationToAnchorMember:
The translation vector for the array.
anchorMember:
Indicates if the translation vector specifies the location of the second member
of the array, or the last member of the array.
Returns:
The ids of the elements created during the operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id does not exist in the document
-or-
id is not arrayable.
-or-
count must be between 2 and 200.
-or-
The view is invalid for specific view elements array.
-or-
The translation point vector is invalid to array the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the linear array.

Autodesk.Revit.DB.LinearArray.ArrayElementsWithoutAssociation(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},System.Int32,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ArrayAnchorMember)
Creates a new linear array from a set of elements.
Remarks:
The resulting elements will not be associated with an array element.
aDoc:
The document.
dBView:
The view. If it is a 2d view, translation vector must be in the view plane if elements include view-specific elements.
If elements include view-specific elements, they must belong to this view.
ids:
The elements to array.
count:
The number of array members to create including the initial
element grouping. Must between 2 and 200.
translationToAnchorMember:
The translation vector for the array.
anchorMember:
Indicates if the translation vector specifies the location of the second member
of the array, or the last member of the array.
Returns:
The ids of the elements created during the operation.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
One or more elements in ids do not exist in the document.
-or-
One or more elements in ids is owned by different views and thus cannot be arrayed together.
-or-
One or more elements in ids is not arrayable.
-or-
count must be between 2 and 200.
-or-
The view is invalid for specific view elements array.
-or-
The translation point vector is invalid to array the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the linear array.

Autodesk.Revit.DB.LinearArray.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId,System.Int32,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ArrayAnchorMember)
Creates a new linear array element from a single element.
aDoc:
The document.
dBView:
The view. If it is a 2d view, translation vector must be in the view plane if the element is a view-specific element.
id:
The element to array.
count:
The number of array members to create including the initial
element grouping. Must between 2 and 200.
translationToAnchorMember:
The translation vector for the array.
anchorMember:
Indicates if the translation vector specifies the location of the second member
of the array, or the last member of the array.
Returns:
The new linear array element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The element id does not exist in the document
-or-
id is not arrayable.
-or-
count must be between 2 and 200.
-or-
The view is invalid for specific view elements array.
-or-
The translation point vector is invalid to array the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the linear array.

Autodesk.Revit.DB.LinearArray.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},System.Int32,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.ArrayAnchorMember)
Creates a new linear array element from a set of elements.
aDoc:
The document.
dBView:
The view. If it is a 2d view, translation vector must be in the view plane if elements include view-specific elements.
If elements include view-specific elements, they must belong to this view.
ids:
The elements to array.
count:
The number of array members to create including the initial
element grouping. Must between 2 and 200.
translationToAnchorMember:
The translation vector for the array.
anchorMember:
Indicates if the translation vector specifies the location of the second member
of the array, or the last member of the array.
Returns:
The new linear array element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given element id set is empty.
-or-
One or more elements in ids do not exist in the document.
-or-
One or more elements in ids is owned by different views and thus cannot be arrayed together.
-or-
One or more elements in ids is not arrayable.
-or-
count must be between 2 and 200.
-or-
The view is invalid for specific view elements array.
-or-
The translation point vector is invalid to array the element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the linear array.

Autodesk.Revit.DB.LinearArray.GetCopiedMemberIds
Retrieves the copied member Ids of the Array.
Returns: The copied member Ids of the Array
Since: 2013

Autodesk.Revit.DB.LinearArray.GetOriginalMemberIds
Retrieves the original member Ids of the Array.
Returns: The original member Ids of the Array
Since: 2013

Autodesk.Revit.DB.LinearArray.NumMembers
Retrieves or changes the number of the arrayed members.

Autodesk.Revit.DB.LinearArray
An object that represents an Array created linearly within the Revit project.